MikroElektronika/core_packages/RX/gcc/def/renesas/R5F526T8ADFL/mcu.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GTINTA : 1;
			unsigned long GTINTB : 1;
			unsigned long GTINTC : 1;
			unsigned long GTINTD : 1;
			unsigned long GTINTE : 1;
			unsigned long GTINTF : 1;
			unsigned long GTINTPR : 2;
			unsigned long SCFA : 1;
			unsigned long SCFB : 1;
			unsigned long SCFC : 1;
			unsigned long SCFD : 1;
			unsigned long SCFE : 1;
			unsigned long SCFF : 1;
			unsigned long SCFPO : 1;
			unsigned long SCFPU : 1;
			unsigned long ADTRAUEN : 1;
			unsigned long ADTRADEN : 1;
			unsigned long ADTRBUEN : 1;
			unsigned long ADTRBDEN : 1;
			unsigned long  : 4;
			unsigned long GRP : 2;
			unsigned long  : 2;
			unsigned long GRPDTE : 1;
			unsigned long GRPABH : 1;
			unsigned long GRPABL : 1;
			unsigned long GTINTPC : 1;
#else
			unsigned long GTINTPC : 1;
			unsigned long GRPABL : 1;
			unsigned long GRPABH : 1;
			unsigned long GRPDTE : 1;
			unsigned long  : 2;
			unsigned long GRP : 2;
			unsigned long  : 4;
			unsigned long ADTRBDEN : 1;
			unsigned long ADTRBUEN : 1;
			unsigned long ADTRADEN : 1;
			unsigned long ADTRAUEN : 1;
			unsigned long SCFPU : 1;
			unsigned long SCFPO : 1;
			unsigned long SCFF : 1;
			unsigned long SCFE : 1;
			unsigned long SCFD : 1;
			unsigned long SCFC : 1;
			unsigned long SCFB : 1;
			unsigned long SCFA : 1;
			unsigned long GTINTPR : 2;
			unsigned long GTINTF : 1;
			unsigned long GTINTE : 1;
			unsigned long GTINTD : 1;
			unsigned long GTINTC : 1;
			unsigned long GTINTB : 1;
			unsigned long GTINTA : 1;
#endif
	} BIT;
	} GTINTAD;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TCFA : 1;
			unsigned long TCFB : 1;
			unsigned long TCFC : 1;
			unsigned long TCFD : 1;
			unsigned long TCFE : 1;
			unsigned long TCFF : 1;
			unsigned long TCFPO : 1;
			unsigned long TCFPU : 1;
			unsigned long ITCNT : 3;
			unsigned long  : 4;
			unsigned long TUCF : 1;
			unsigned long ADTRAUF : 1;
			unsigned long ADTRADF : 1;
			unsigned long ADTRBUF : 1;
			unsigned long ADTRBDF : 1;
			unsigned long  : 4;
			unsigned long ODF : 1;
			unsigned long  : 3;
			unsigned long DTEF : 1;
			unsigned long OABHF : 1;
			unsigned long OABLF : 1;
			unsigned long PCF : 1;
#else
			unsigned long PCF : 1;
			unsigned long OABLF : 1;
			unsigned long OABHF : 1;
			unsigned long DTEF : 1;
			unsigned long  : 3;
			unsigned long ODF : 1;
			unsigned long  : 4;
			unsigned long ADTRBDF : 1;
			unsigned long ADTRBUF : 1;
			unsigned long ADTRADF : 1;
			unsigned long ADTRAUF : 1;
			unsigned long TUCF : 1;
			unsigned long  : 4;
			unsigned long ITCNT : 3;
			unsigned long TCFPU : 1;
			unsigned long TCFPO : 1;
			unsigned long TCFF : 1;
			unsigned long TCFE : 1;
			unsigned long TCFD : 1;
			unsigned long TCFC : 1;
			unsigned long TCFB : 1;
			unsigned long TCFA : 1;
#endif
	} BIT;
	} GTST;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BD : 4;
			unsigned long  : 4;
			unsigned long DBRTECA : 1;
			unsigned long DBRTSCA : 1;
			unsigned long DBRTECB : 1;
			unsigned long DBRTSCB : 1;
			unsigned long DBRTEADA : 1;
			unsigned long DBRTSADA : 1;
			unsigned long DBRTEADB : 1;
			unsigned long DBRTSADB : 1;
			unsigned long CCRA : 2;
			unsigned long CCRB : 2;
			unsigned long PR : 2;
			unsigned long CCRSWT : 1;
			unsigned long  : 1;
			unsigned long ADTTA : 2;
			unsigned long ADTDA : 1;
			unsigned long  : 1;
			unsigned long ADTTB : 2;
			unsigned long ADTDB : 1;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long ADTDB : 1;
			unsigned long ADTTB : 2;
			unsigned long  : 1;
			unsigned long ADTDA : 1;
			unsigned long ADTTA : 2;
			unsigned long  : 1;
			unsigned long CCRSWT : 1;
			unsigned long PR : 2;
			unsigned long CCRB : 2;
			unsigned long CCRA : 2;
			unsigned long DBRTSADB : 1;
			unsigned long DBRTEADB : 1;
			unsigned long DBRTSADA : 1;
			unsigned long DBRTEADA : 1;
			unsigned long DBRTSCB : 1;
			unsigned long DBRTECB : 1;
			unsigned long DBRTSCA : 1;
			unsigned long DBRTECA : 1;
			unsigned long  : 4;
			unsigned long BD : 4;
#endif
	} BIT;
	} GTBER;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ITLA : 1;
			unsigned long ITLB : 1;
			unsigned long ITLC : 1;
			unsigned long ITLD : 1;
			unsigned long ITLE : 1;
			unsigned long ITLF : 1;
			unsigned long IVTC : 2;
			unsigned long IVTT : 3;
			unsigned long  : 1;
			unsigned long ADTAL : 1;
			unsigned long  : 1;
			unsigned long ADTBL : 1;
			unsigned long  : 17;
#else
			unsigned long  : 17;
			unsigned long ADTBL : 1;
			unsigned long  : 1;
			unsigned long ADTAL : 1;
			unsigned long  : 1;
			unsigned long IVTT : 3;
			unsigned long IVTC : 2;
			unsigned long ITLF : 1;
			unsigned long ITLE : 1;
			unsigned long ITLD : 1;
			unsigned long ITLC : 1;
			unsigned long ITLB : 1;
			unsigned long ITLA : 1;
#endif
	} BIT;
	} GTITC;
	unsigned long  GTCNT;
	unsigned long  GTCCRA;
	unsigned long  GTCCRB;
	unsigned long  GTCCRC;
	unsigned long  GTCCRE;
	unsigned long  GTCCRD;
	unsigned long  GTCCRF;
	unsigned long  GTPR;
	unsigned long  GTPBR;
	unsigned long  GTPDBR;
	unsigned long  GTADTRA;
	unsigned long  GTADTBRA;
	unsigned long  GTADTDBRA;
	unsigned long  GTADTRB;
	unsigned long  GTADTBRB;
	unsigned long  GTADTDBRB;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TDE : 1;
			unsigned long  : 3;
			unsigned long TDBUE : 1;
			unsigned long TDBDE : 1;
			unsigned long  : 2;
			unsigned long TDFER : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long TDFER : 1;
			unsigned long  : 2;
			unsigned long TDBDE : 1;
			unsigned long TDBUE : 1;
			unsigned long  : 3;
			unsigned long TDE : 1;
#endif
	} BIT;
	} GTDTCR;
	unsigned long  GTDVU;
	unsigned long  GTDVD;
	unsigned long  GTDBU;
	unsigned long  GTDBD;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SOS : 2;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long SOS : 2;
#endif
	} BIT;
	} GTSOS;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SOTR : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long SOTR : 1;
#endif
	} BIT;
	} GTSOTR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ADSMS0 : 2;
			unsigned long  : 6;
			unsigned long ADSMEN0 : 1;
			unsigned long  : 7;
			unsigned long ADSMS1 : 2;
			unsigned long  : 6;
			unsigned long ADSMEN1 : 1;
			unsigned long  : 7;
#else
			unsigned long  : 7;
			unsigned long ADSMEN1 : 1;
			unsigned long  : 6;
			unsigned long ADSMS1 : 2;
			unsigned long  : 7;
			unsigned long ADSMEN0 : 1;
			unsigned long  : 6;
			unsigned long ADSMS0 : 2;
#endif
	} BIT;
	} GTADSMR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EIVTC1 : 2;
			unsigned long  : 2;
			unsigned long EIVTT1 : 4;
			unsigned long  : 4;
			unsigned long EITCNT1 : 4;
			unsigned long EIVTC2 : 2;
			unsigned long  : 2;
			unsigned long EIVTT2 : 4;
			unsigned long EITCNT2IV : 4;
			unsigned long EITCNT2 : 4;
#else
			unsigned long EITCNT2 : 4;
			unsigned long EITCNT2IV : 4;
			unsigned long EIVTT2 : 4;
			unsigned long  : 2;
			unsigned long EIVTC2 : 2;
			unsigned long EITCNT1 : 4;
			unsigned long  : 4;
			unsigned long EIVTT1 : 4;
			unsigned long  : 2;
			unsigned long EIVTC1 : 2;
#endif
	} BIT;
	} GTEITC;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EITLA : 3;
			unsigned long  : 1;
			unsigned long EITLB : 3;
			unsigned long  : 1;
			unsigned long EITLC : 3;
			unsigned long  : 1;
			unsigned long EITLD : 3;
			unsigned long  : 1;
			unsigned long EITLE : 3;
			unsigned long  : 1;
			unsigned long EITLF : 3;
			unsigned long  : 1;
			unsigned long EITLV : 3;
			unsigned long  : 1;
			unsigned long EITLU : 3;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long EITLU : 3;
			unsigned long  : 1;
			unsigned long EITLV : 3;
			unsigned long  : 1;
			unsigned long EITLF : 3;
			unsigned long  : 1;
			unsigned long EITLE : 3;
			unsigned long  : 1;
			unsigned long EITLD : 3;
			unsigned long  : 1;
			unsigned long EITLC : 3;
			unsigned long  : 1;
			unsigned long EITLB : 3;
			unsigned long  : 1;
			unsigned long EITLA : 3;
#endif
	} BIT;
	} GTEITLI1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EADTAL : 3;
			unsigned long  : 1;
			unsigned long EADTBL : 3;
			unsigned long  : 25;
#else
			unsigned long  : 25;
			unsigned long EADTBL : 3;
			unsigned long  : 1;
			unsigned long EADTAL : 3;
#endif
	} BIT;
	} GTEITLI2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EBTLCA : 3;
			unsigned long  : 1;
			unsigned long EBTLCB : 3;
			unsigned long  : 1;
			unsigned long EBTLPR : 3;
			unsigned long  : 5;
			unsigned long EBTLADA : 3;
			unsigned long  : 1;
			unsigned long EBTLADB : 3;
			unsigned long  : 1;
			unsigned long EBTLDVU : 3;
			unsigned long  : 1;
			unsigned long EBTLDVD : 3;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long EBTLDVD : 3;
			unsigned long  : 1;
			unsigned long EBTLDVU : 3;
			unsigned long  : 1;
			unsigned long EBTLADB : 3;
			unsigned long  : 1;
			unsigned long EBTLADA : 3;
			unsigned long  : 5;
			unsigned long EBTLPR : 3;
			unsigned long  : 1;
			unsigned long EBTLCB : 3;
			unsigned long  : 1;
			unsigned long EBTLCA : 3;
#endif
	} BIT;
	} GTEITLB;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ICLFA : 3;
			unsigned long  : 1;
			unsigned long ICLFSELC : 6;
			unsigned long  : 6;
			unsigned long ICLFB : 3;
			unsigned long  : 1;
			unsigned long ICLFSELD : 6;
			unsigned long  : 6;
#else
			unsigned long  : 6;
			unsigned long ICLFSELD : 6;
			unsigned long  : 1;
			unsigned long ICLFB : 3;
			unsigned long  : 6;
			unsigned long ICLFSELC : 6;
			unsigned long  : 1;
			unsigned long ICLFA : 3;
#endif
	} BIT;
	} GTICLF;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PCEN : 1;
			unsigned long  : 7;
			unsigned long ASTP : 1;
			unsigned long  : 7;
			unsigned long PCNT : 12;
			unsigned long  : 4;
#else
			unsigned long  : 4;
			unsigned long PCNT : 12;
			unsigned long  : 7;
			unsigned long ASTP : 1;
			unsigned long  : 7;
			unsigned long PCEN : 1;
#endif
	} BIT;
	} GTPC;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ADCMSC1 : 2;
			unsigned long  : 2;
			unsigned long ADCMST1 : 4;
			unsigned long ADCMSCNT1IV : 4;
			unsigned long ADCMSCNT1 : 4;
			unsigned long ADCMSC2 : 2;
			unsigned long  : 2;
			unsigned long ADCMST2 : 4;
			unsigned long ADCMSCNT2IV : 4;
			unsigned long ADCMSCNT2 : 4;
#else
			unsigned long ADCMSCNT2 : 4;
			unsigned long ADCMSCNT2IV : 4;
			unsigned long ADCMST2 : 4;
			unsigned long  : 2;
			unsigned long ADCMSC2 : 2;
			unsigned long ADCMSCNT1 : 4;
			unsigned long ADCMSCNT1IV : 4;
			unsigned long ADCMST1 : 4;
			unsigned long  : 2;
			unsigned long ADCMSC1 : 2;
#endif
	} BIT;
	} GTADCMSC;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ADCMSAL : 3;
			unsigned long  : 1;
			unsigned long ADCMSBL : 3;
			unsigned long  : 9;
			unsigned long ADCMBSA : 3;
			unsigned long  : 1;
			unsigned long ADCMBSB : 3;
			unsigned long  : 9;
#else
			unsigned long  : 9;
			unsigned long ADCMBSB : 3;
			unsigned long  : 1;
			unsigned long ADCMBSA : 3;
			unsigned long  : 9;
			unsigned long ADCMSBL : 3;
			unsigned long  : 1;
			unsigned long ADCMSAL : 3;
#endif
	} BIT;
	} GTADCMSS;
	char           wk0[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SECSEL0 : 1;
			unsigned long SECSEL1 : 1;
			unsigned long SECSEL2 : 1;
			unsigned long SECSEL3 : 1;
			unsigned long SECSEL4 : 1;
			unsigned long SECSEL5 : 1;
			unsigned long SECSEL6 : 1;
			unsigned long SECSEL7 : 1;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long SECSEL7 : 1;
			unsigned long SECSEL6 : 1;
			unsigned long SECSEL5 : 1;
			unsigned long SECSEL4 : 1;
			unsigned long SECSEL3 : 1;
			unsigned long SECSEL2 : 1;
			unsigned long SECSEL1 : 1;
			unsigned long SECSEL0 : 1;
#endif
	} BIT;
	} GTSECSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SBDCE : 1;
			unsigned long SBDPE : 1;
			unsigned long SBDAE : 1;
			unsigned long SBDDE : 1;
			unsigned long  : 4;
			unsigned long SBDCD : 1;
			unsigned long SBDPD : 1;
			unsigned long SBDAD : 1;
			unsigned long SBDDD : 1;
			unsigned long  : 4;
			unsigned long SPCE : 1;
			unsigned long SSCE : 1;
			unsigned long  : 6;
			unsigned long SPCD : 1;
			unsigned long SSCD : 1;
			unsigned long  : 6;
#else
			unsigned long  : 6;
			unsigned long SSCD : 1;
			unsigned long SPCD : 1;
			unsigned long  : 6;
			unsigned long SSCE : 1;
			unsigned long SPCE : 1;
			unsigned long  : 4;
			unsigned long SBDDD : 1;
			unsigned long SBDAD : 1;
			unsigned long SBDPD : 1;
			unsigned long SBDCD : 1;
			unsigned long  : 4;
			unsigned long SBDDE : 1;
			unsigned long SBDAE : 1;
			unsigned long SBDPE : 1;
			unsigned long SBDCE : 1;
#endif
	} BIT;
	} GTSECR;
	char           wk1[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CCTCA : 1;
			unsigned long CCTCB : 1;
			unsigned long CCTPR : 1;
			unsigned long CCTADA : 1;
			unsigned long CCTADB : 1;
			unsigned long CCTDV : 1;
			unsigned long  : 2;
			unsigned long CMTCA : 2;
			unsigned long CMTCB : 2;
			unsigned long  : 1;
			unsigned long CMTADA : 1;
			unsigned long CMTADB : 1;
			unsigned long  : 1;
			unsigned long CPTCA : 1;
			unsigned long CPTCB : 1;
			unsigned long CPTPR : 1;
			unsigned long CPTADA : 1;
			unsigned long CPTADB : 1;
			unsigned long CPTDV : 1;
			unsigned long  : 2;
			unsigned long CP3DB : 1;
			unsigned long CPBTD : 1;
			unsigned long OLTTA : 2;
			unsigned long OLTTB : 2;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long OLTTB : 2;
			unsigned long OLTTA : 2;
			unsigned long CPBTD : 1;
			unsigned long CP3DB : 1;
			unsigned long  : 2;
			unsigned long CPTDV : 1;
			unsigned long CPTADB : 1;
			unsigned long CPTADA : 1;
			unsigned long CPTPR : 1;
			unsigned long CPTCB : 1;
			unsigned long CPTCA : 1;
			unsigned long  : 1;
			unsigned long CMTADB : 1;
			unsigned long CMTADA : 1;
			unsigned long  : 1;
			unsigned long CMTCB : 2;
			unsigned long CMTCA : 2;
			unsigned long  : 2;
			unsigned long CCTDV : 1;
			unsigned long CCTADB : 1;
			unsigned long CCTADA : 1;
			unsigned long CCTPR : 1;
			unsigned long CCTCB : 1;
			unsigned long CCTCA : 1;
#endif
	} BIT;
	} GTBER2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GTIOAB : 5;
			unsigned long  : 11;
			unsigned long GTIOBB : 5;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long GTIOBB : 5;
			unsigned long  : 11;
			unsigned long GTIOAB : 5;
#endif
	} BIT;
	} GTOLBR;
	char           wk2[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ICAFA : 1;
			unsigned long ICAFB : 1;
			unsigned long ICAFC : 1;
			unsigned long ICAFD : 1;
			unsigned long ICAFE : 1;
			unsigned long ICAFF : 1;
			unsigned long ICAFPO : 1;
			unsigned long ICAFPU : 1;
			unsigned long ICACLK : 1;
			unsigned long  : 5;
			unsigned long ICAGRP : 2;
			unsigned long ICBFA : 1;
			unsigned long ICBFB : 1;
			unsigned long ICBFC : 1;
			unsigned long ICBFD : 1;
			unsigned long ICBFE : 1;
			unsigned long ICBFF : 1;
			unsigned long ICBFPO : 1;
			unsigned long ICBFPU : 1;
			unsigned long ICBCLK : 1;
			unsigned long  : 5;
			unsigned long ICBGRP : 2;
#else
			unsigned long ICBGRP : 2;
			unsigned long  : 5;
			unsigned long ICBCLK : 1;
			unsigned long ICBFPU : 1;
			unsigned long ICBFPO : 1;
			unsigned long ICBFF : 1;
			unsigned long ICBFE : 1;
			unsigned long ICBFD : 1;
			unsigned long ICBFC : 1;
			unsigned long ICBFB : 1;
			unsigned long ICBFA : 1;
			unsigned long ICAGRP : 2;
			unsigned long  : 5;
			unsigned long ICACLK : 1;
			unsigned long ICAFPU : 1;
			unsigned long ICAFPO : 1;
			unsigned long ICAFF : 1;
			unsigned long ICAFE : 1;
			unsigned long ICAFD : 1;
			unsigned long ICAFC : 1;
			unsigned long ICAFB : 1;
			unsigned long ICAFA : 1;
#endif
	} BIT;
	} GTICCR;
} st_gptw0_t;

